#include <iostream>
//https://www.acmicpc.net/problem/11726

/*
<2xn 타일링>
주요: 규칙을 찾아본다.
1. 2x1, 2x2, 2x3, 2x4 ... 하나씩 구해보면 점화식을 짐작할 수 있다.
2. ex)  2x4기준 (2x2오른쪽에 1x2 2개 붙이는 경우) + (2x3 오른쪽에 2x1 1개 붙이는 경우)
        2x5기준 (2x3오른쪽에 1x2 2개 붙이는 경우) + (2x4 오른쪽에 2x1 1개 붙이는 경우)
        .
        .
        .
3. 빈공간 2칸일 때(A(n-2)) 붙이는 방법 1가지, 빈공간 1칸일 때(A(n-1)) 1가지 둘다 결국 기준상 한가지 경우 이므로
4. A(n) = A(n-2) + A(n-1) 이라는 점화식을 구할 수 있다.

*/

int main() {

  int n;
  int tile[1002] = {0, 1, 2,};

  // 오버플로우 방지를 위해 나머지 계산 후 저장해준다.
  for (int i = 3; i < 1001; i++) {
    tile[i] = (tile[i-2] + tile[i-1]) % 10007;
  }

  scanf("%d", &n);
  printf("%d\n", tile[n]);

  return 0;
}
